# -*- coding: utf-8 -*-

import jieba
import jieba.posseg as pseg #词性标注
import jieba.analyse as anls #关键词提取

jieba.load_userdict('entities_new.txt')
emr = {
    "姓名": "***",
    "性别": "女",
    "年龄": "58岁",
    "门诊号": "50103801",
    "就诊时间": "_急诊",
    "科室": "内科门诊",
    "药物过敏史": "无",
    "主诉": "不适复诊",
    "现病史": "胃脘部不适，胀满，伴嗳气，反酸。胃纳一般，小便正常，大便欠畅。睡眠安。",
    "既往史及其他病史": "否认急性传染病史；否认肝炎史；否认结核病史，否认疟疾病；幼年时曾接种疫苗名称不详，否认肺部疾病史；否认外伤史；否认手术史；否认过敏史。长期居留于广州，无疫水接触史；否认吸烟嗜好；否认饮酒嗜好。",
    "体格检查": "腹部平坦，腹壁静脉无显露，未见胃肠型，未见蠕动波，无异常搏动，腹壁柔软，全腹无压痛，无反跳痛，无包块，肝脾肋下未触及。胸廓对称，胸骨无压痛，双侧语颤对称；无胸膜摩擦感，叩诊正常清音，双肺呼吸音清晰，双肺未闻及干、湿性罗音，未闻及胸膜摩擦音。心尖搏动正常，心前区无震颤或异常搏动，无心包摩擦感；心浊音界正常；心律齐，心音正常，心脏各瓣膜听诊区未闻及杂音。",
    "辅助检查": "待回复",
    "初步诊断": "1、腹泻；2、腹胀；3、头痛；4、睡眠障碍",
    "处理": "1常规心电图（十五导联）**1心电图室20.1心可舒片（国基）0.31g×144片用法：口服每日三次，每次1.24g0.2铝镁匹林片(II)(国谈)1片×30片用法：口服每日一次，每次1片",
    "嘱托": "适当休息，适度活动，合理饮食，按时服药"}
# 精确模式
seg_list = jieba.cut(emr['现病史'], cut_all=False)
print("【精确模式】：" + "/ ".join(seg_list))  